tap "homebrew/bundle"
tap "homebrew/services"
tap "luzen23141/taps"
tap "ngrok/ngrok"
tap "shivammathur/php"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Asynchronous DNS library
brew "c-ares"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Next generation open source RPC library and framework
brew "grpc"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Simplified-traditional Chinese conversion tool
brew "opencc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# User interface to the TELNET protocol
brew "telnet"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Compress/expand executable files
brew "upx"
# Internet file retriever
brew "wget"
# Live reload for Go apps.
brew "luzen23141/taps/air"
# Cryptography and SSL/TLS Toolkit
brew "luzen23141/taps/openssl@1.1"
# Rsync for cloud storage
brew "luzen23141/taps/rclone"
# General-purpose scripting language
brew "shivammathur/php/php@7.3"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Platform for API documentation, debugging, Mock and testing
cask "apipost7"
# User-friendly GUI app for Homebrew
cask "applite"
# Chromium based browser
cask "arc"
# Web browser focusing on privacy
cask "brave-browser"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Software for Logitech devices
cask "logi-options+"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Collection of apps available by subscription
cask "setapp"
# Graphical client for Git version control
cask "sourcetree"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Network toolbox
cask "surge"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Multimedia player
cask "vlc"
mas "1Password for Safari", id: 1569813296
mas "Canva", id: 897446215
mas "LINE", id: 539883307
mas "Spark", id: 1176895641
mas "WeChat", id: 836500024
mas "WhatsApp", id: 310633997
mas "Yoink", id: 457622435
