tap "luzen23141/taps", trusted: true
tap "oven-sh/bun", trusted: true
tap "shivammathur/extensions", trusted: true
tap "shivammathur/php", trusted: true
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Language server for the Go language
brew "gopls"
# Next generation open source RPC library and framework
brew "grpc"
# Update binaries installed by go install
brew "gup"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Deep clean and optimize your Mac
brew "mole"
# Open source relational database management system
brew "mysql"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Simplified-traditional Chinese conversion tool
brew "opencc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# TOML toolkit written in Rust
brew "taplo"
# User interface to the TELNET protocol
brew "telnet"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Compress/expand executable files
brew "upx"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Terminal interface for Antigravity agents
cask "antigravity-cli"
# Platform for API documentation, debugging, Mock and testing
cask "apipost"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Screen capturing tool
cask "cleanshot"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Software for Logitech devices
cask "logi-options+"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# Menu bar manager
cask "thaw"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multiplayer code editor
cask "zed"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
go "golang.org/x/tools/cmd/goimports"
