tap "luzen23141/taps"
tap "shivammathur/php"
# Fast and opinionated formatter for R code
brew "air"
# Library for manipulating PNG images
brew "libpng"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Asynchronous DNS library
brew "c-ares"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Next generation open source RPC library and framework
brew "grpc"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Simplified-traditional Chinese conversion tool
brew "opencc"
# PNG file optimizer
brew "optipng"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Persistent key-value database, with built-in net interface
brew "redis"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# User interface to the TELNET protocol
brew "telnet"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Compress/expand executable files
brew "upx"
# Internet file retriever
brew "wget"
# Cryptography and SSL/TLS Toolkit
brew "luzen23141/taps/openssl@1.1"
# Rsync for cloud storage
brew "luzen23141/taps/rclone"
# General-purpose scripting language
brew "shivammathur/php/php@7.3"
# General-purpose scripting language
brew "shivammathur/php/php@7.4"
# General-purpose scripting language
brew "shivammathur/php/php@8.0"
# General-purpose scripting language
brew "shivammathur/php/php@8.1"
# General-purpose scripting language
brew "shivammathur/php/php@8.3"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Platform for API documentation, debugging, Mock and testing
cask "apipost"
# Platform for API documentation, debugging, Mock and testing
cask "apipost7"
# Web browser focusing on privacy
cask "brave-browser"
cask "font-hack-nerd-font"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Software for Logitech devices
cask "logi-options+"
# Clipboard manager
cask "maccy"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Collection of apps available by subscription
cask "setapp"
# Graphical client for Git version control
cask "sourcetree"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Network toolbox
cask "surge"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
go "github.com/xuri/xgen/cmd/xgen"
